# Ablation variant: YOLO11s + BiFPN only (no P2 head, no EMA)
# Same 3-head structure as original, but Concat replaced with BiFPN_Concat

nc: 80
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, BiFPN_Concat, [1]]
  - [-1, 2, C3k2, [512, False]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, BiFPN_Concat, [1]]
  - [-1, 2, C3k2, [256, False]]         # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, BiFPN_Concat, [1]]
  - [-1, 2, C3k2, [512, False]]         # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, BiFPN_Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]         # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]      # Detect(P3, P4, P5)
