# AFA-YOLO11-Final: The complete AFA-YOLO11 architecture (recommended for thesis)
# Full Name: Aligned Fusion Adaptive YOLO11 for Small Object Detection in UAV Imagery
# Innovations: P2 + SGFA (Small-object Guided Feature Alignment) + SOA-SAFM (P2 adaptive fusion)
# Base: YOLO11s
#
# Architecture Design:
#   - Backbone: YOLO11s (clean, no EMA to avoid module stacking)
#   - Top-down: SGFA for small-object guided soft alignment
#   - Bottom-up: BiFPN_Concat (kept as stable anchor for ablation studies)
#   - Enhancement: SOA-SAFM on P2 (spatial adaptive multi-scale fusion)
#   - Detection: Four-scale heads (O2, P3, P4, P5)
#
# Key Design Rationale:
#   1. Why keep BiFPN in bottom-up?
#      - Serves as stable anchor for ablation experiments
#      - Isolates SGFA and SOA-SAFM contributions
#      - Can be replaced with Concat/SGFA in future experiments
#
#   2. Why only enhance P2 with SOA-SAFM?
#      - P2 is the most critical layer for small object detection
#      - Minimal parameter increase (~145K)
#      - Validate effectiveness before extending to P3
#
#   3. Why ratio=1.0 in SGFA?
#      - Baseline configuration for ablation studies
#      - Compare with ratio=0.5 as lightweight variant
#
# Experiment Usage:
#   Main model:  python train.py --exp afa_yolo_final_pt
#   Ablation:    Compare with baseline, uav_yolo, sgfa_pt
#   Lightweight: Modify SGFA args to [1, 0.5] for ratio=0.5

nc: 80
scales:
  s: [0.50, 0.50, 1024]

# Backbone: Standard YOLO11s (no attention modules)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2  - P2 features
  - [-1, 1, Conv, [256, 3, 2]]          # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4  - P3 features
  - [-1, 1, Conv, [512, 3, 2]]          # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]          # 6  - P4 features
  - [-1, 1, Conv, [1024, 3, 2]]         # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10 - P5 output

# Head: SGFA (top-down) + BiFPN (bottom-up) + SOA-SAFM (P2 enhancement)
head:
  # ---- Top-down pathway with SGFA (soft alignment) ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - P5 upsample
  - [[-1, 6], 1, SGFA, [1]]                       # 12 - SGFA: P5_up + P4 → aligned
  - [-1, 2, C3k2, [512, False]]                   # 13 - P4 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - P4 upsample
  - [[-1, 4], 1, SGFA, [1]]                       # 15 - SGFA: P4_up + P3 → aligned
  - [-1, 2, C3k2, [256, False]]                   # 16 - P3 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - P3 upsample
  - [[-1, 2], 1, SGFA, [1]]                       # 18 - SGFA: P3_up + P2 → aligned
  - [-1, 2, C3k2, [128, False]]                   # 19 - P2 fused (base)

  # ---- Bottom-up pathway with BiFPN (stable anchor) ----
  - [-1, 1, Conv, [128, 3, 2]]                    # 20 - P2 downsample
  - [[-1, 16], 1, BiFPN_Concat, [1]]              # 21 - BiFPN: P2_down + P3
  - [-1, 2, C3k2, [256, False]]                   # 22 - P3/8

  - [-1, 1, Conv, [256, 3, 2]]                    # 23 - P3 downsample
  - [[-1, 13], 1, BiFPN_Concat, [1]]              # 24 - BiFPN: P3_down + P4
  - [-1, 2, C3k2, [512, False]]                   # 25 - P4/16

  - [-1, 1, Conv, [512, 3, 2]]                    # 26 - P4 downsample
  - [[-1, 10], 1, BiFPN_Concat, [1]]              # 27 - BiFPN: P4_down + P5
  - [-1, 2, C3k2, [1024, True]]                   # 28 - P5/32

  # ---- SOA-SAFM Enhancement for P2 (spatial adaptive fusion) ----
  # Inputs: [P2_base(19), P3(22), P4(25)]
  # target_index=0: output matches P2 spatial size and channels
  # This is the core innovation #2 (SGFA is core innovation #1)
  - [[19, 22, 25], 1, SOA_SAFM, [0]]              # 29 - O2: P2 enhanced with adaptive fusion

  # ---- Four-scale detection head ----
  # Use enhanced O2 for P2 detection, original outputs for P3/P4/P5
  # This is the final AFA-YOLO11 output configuration
  - [[29, 22, 25, 28], 1, Detect, [nc]]           # 30 - Detect(O2, P3, P4, P5)


# Model Variants (modify this file for different experiments):
#
# 1. Lightweight SGFA (ratio=0.5):
#    Change line 12/15/18 args from [1] to [1, 0.5]
#
# 2. Remove BiFPN (all Concat):
#    Change line 21/24/27 from BiFPN_Concat to Concat
#
# 3. Remove BiFPN (all SGFA):
#    Change line 21/24/27 from BiFPN_Concat to SGFA
#
# 4. Add SOA-SAFM for P3:
#    Insert after line 29:
#    - [[19, 22, 25, 28], 1, SOA_SAFM, [1]]  # O3
#    Modify line 30 to: [[29, O3, 25, 28], 1, Detect, [nc]]
#
# Note: These variants should be created as separate YAML files for clarity
