# AFA-YOLO11: Aligned Fusion Adaptive YOLO11 for Small Object Detection in UAV Imagery
# Innovations: P2 Detection Head + SGFA (Small-object Guided Feature Alignment) + BiFPN Bottom-up
# Base: YOLO11s
#
# Key difference from UAV-YOLO:
#   - Top-down fusion uses SGFA (soft alignment with small-object guidance)
#   - Bottom-up fusion still uses BiFPN_Concat (for stability in first version)
#   - Removed EMA from backbone (avoid module stacking)

nc: 80
scales:
  s: [0.50, 0.50, 1024]

# Backbone (no EMA in first version - focus on SGFA innovation)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2  - P2 features
  - [-1, 1, Conv, [256, 3, 2]]          # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4  - P3 features
  - [-1, 1, Conv, [512, 3, 2]]          # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]          # 6  - P4 features
  - [-1, 1, Conv, [1024, 3, 2]]         # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10 - P5 output

# Head: SGFA top-down + BiFPN bottom-up + P2 detection head
head:
  # ---- Top-down pathway with SGFA ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - P5 upsample
  - [[-1, 6], 1, SGFA, [1]]                       # 12 - SGFA: P5_up + P4 (soft alignment)
  - [-1, 2, C3k2, [512, False]]                   # 13 - P4 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - P4 upsample
  - [[-1, 4], 1, SGFA, [1]]                       # 15 - SGFA: P4_up + P3 (soft alignment)
  - [-1, 2, C3k2, [256, False]]                   # 16 - P3 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - P3 upsample
  - [[-1, 2], 1, SGFA, [1]]                       # 18 - SGFA: P3_up + P2 (soft alignment)
  - [-1, 2, C3k2, [128, False]]                   # 19 - P2/4 (small objects)

  # ---- Bottom-up pathway with BiFPN (keep for stability) ----
  - [-1, 1, Conv, [128, 3, 2]]                    # 20 - P2 downsample
  - [[-1, 16], 1, BiFPN_Concat, [1]]              # 21 - BiFPN: P2_down + P3
  - [-1, 2, C3k2, [256, False]]                   # 22 - P3/8

  - [-1, 1, Conv, [256, 3, 2]]                    # 23 - P3 downsample
  - [[-1, 13], 1, BiFPN_Concat, [1]]              # 24 - BiFPN: P3_down + P4
  - [-1, 2, C3k2, [512, False]]                   # 25 - P4/16

  - [-1, 1, Conv, [512, 3, 2]]                    # 26 - P4 downsample
  - [[-1, 10], 1, BiFPN_Concat, [1]]              # 27 - BiFPN: P4_down + P5
  - [-1, 2, C3k2, [1024, True]]                   # 28 - P5/32

  # ---- Four-scale detection head ----
  - [[19, 22, 25, 28], 1, Detect, [nc]]           # 29 - Detect(P2, P3, P4, P5)
