# UAV-YOLO: Improved YOLO11 for Small Object Detection in UAV Imagery
# Innovations: P2 Detection Head + BiFPN Weighted Fusion + EMA Attention
# Base: YOLO11s

nc: 80
scales:
  s: [0.50, 0.50, 1024]

# Backbone (with EMA attention after C2PSA)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2  - P2 features
  - [-1, 1, Conv, [256, 3, 2]]          # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4  - P3 features
  - [-1, 1, Conv, [512, 3, 2]]          # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]          # 6  - P4 features
  - [-1, 1, Conv, [1024, 3, 2]]         # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10
  - [-1, 1, EMA, [1024]]                # 11 - EMA attention on P5

# Head: BiFPN-style weighted fusion + P2 detection head
head:
  # ---- Top-down pathway ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN_Concat, [1]]               # 13 - fuse P5_up + P4
  - [-1, 2, C3k2, [512, False]]                    # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN_Concat, [1]]               # 16 - fuse P4_up + P3
  - [-1, 2, C3k2, [256, False]]                    # 17 - P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [[-1, 2], 1, BiFPN_Concat, [1]]               # 19 - fuse P3_up + P2
  - [-1, 2, C3k2, [128, False]]                    # 20 - P2/4 (small objects)

  # ---- Bottom-up pathway ----
  - [-1, 1, Conv, [128, 3, 2]]                     # 21
  - [[-1, 17], 1, BiFPN_Concat, [1]]              # 22 - fuse P2_down + P3
  - [-1, 2, C3k2, [256, False]]                    # 23 - P3/8

  - [-1, 1, Conv, [256, 3, 2]]                     # 24
  - [[-1, 14], 1, BiFPN_Concat, [1]]              # 25 - fuse P3_down + P4
  - [-1, 2, C3k2, [512, False]]                    # 26 - P4/16

  - [-1, 1, Conv, [512, 3, 2]]                     # 27
  - [[-1, 11], 1, BiFPN_Concat, [1]]              # 28 - fuse P4_down + P5
  - [-1, 2, C3k2, [1024, True]]                    # 29 - P5/32

  - [[20, 23, 26, 29], 1, Detect, [nc]]            # 30 - Detect(P2, P3, P4, P5)
